Bienvenue dans ce projet complet autour de MySQL, l’un des SGBDR (Systèmes de Gestion de Bases de Données Relationnelles) les plus connus et les plus simples à prendre en main.
Voici le workflow réalisées dans ce projet :
# télécharger le dataset source
1. nettoyer à l'aide de pandas (librairie Python)
2. exporter le dataset nettoyer sur notre base de donnée Mysql en nommant = all_olympic
3. importer cette base sur notre environnement jupyter notebook et la convertir en Dataframe pandas et nommé athletes via cette commande "engine = create_engine(("mysql+pymysql://root:1258@localhost/all_olympic"))
query =  "Select * from athletes;"
athletes = pd.read_sql(query, engine)"
4. vérifier la qualité de notre dataframe afin de voir
* redondance (détections des doublons)
* des valeurs manquantes
* identifications anomalies

# ce Projet est diviser en 3 Phase

1. ## **A )** Analyse Univriate( analyse par colonnes)
2. ## **B )** Analyse Bivariate
3. ## **B )** Analyse Multivariate
4. ## **B )** Créer des VUES pour notre future projet d'applications web streamlit
* Dans cette étape, nous créons plusieurs **vues SQL** qui seront utilisées directement dans notre application web développée avec **Streamlit**. Ces vues permettent de simplifier les requêtes, d’optimiser les performances et de structurer les données de manière plus claire pour l’application.

# 1. nettoyer & Préparer
* Commenceons par commencement nous avons nettoyer et préparer le dataset qui contener des erreure auparavant et enregisterer sous le nom de "Olympic-clean.CSV"
* Nous avons ensuite exporté ce fichier vers notre base de données MySQL nommée **"all_olympic"**, en créant une table appelée **"athletes"**

# 2. Etablir Connexion python avec mysql
* afin qu'on puisse écrire des requetes directement sur notre environnement Jupyter Notebook

In [85]:
from sqlalchemy import create_engine
import pandas as pd


engine = create_engine(("mysql+pymysql://root:1258@localhost/all_olympic"))

query =  "Select * from athletes;"

athletes = pd.read_sql(query, engine)

athletes.sample(3)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
114841,58503,Christian Keller,M,23.0,188.000000,88.000000,Germany,GER,1996 Summer,1996,Summer,Atlanta,Swimming,Swimming Men's 4 x 200 metres Freestyle Relay,Bronze
80465,41087,Jakov Gojun,M,26.0,203.000000,112.000000,Croatia,CRO,2012 Summer,2012,Summer,London,Handball,Handball Men's Handball,Bronze
136798,69142,Nikolaos M. Levidis,M,43.0,175.338953,70.701778,Greece,GRE,1912 Summer,1912,Summer,Stockholm,Shooting,"Shooting Men's Military Rifle, Any Position, 6...",None

# 3.  Vérifier la qualité du data pour etre sure

In [86]:
athletes.isna().sum()

ID             0
Name           0
Sex            0
Age            0
Height         0
Weight         0
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     229959
dtype: int64

In [87]:
print("Voici le nombre de ligne : "), athletes.shape[0],
print("Voici le nombre de colonnes : "), athletes.shape[1],

Voici le nombre de ligne :
Voici le nombre de colonnes :

(None, 15)

In [88]:
print("Voici leur noms: ")
for col in athletes.columns:
    print(col)

Voici leur noms:
ID
Name
Sex
Age
Height
Weight
Team
NOC
Games
Year
Season
City
Sport
Event
Medal

# A) Univarite & KPI

# 1. Nombre total de participant (inclus athlete doublons)

In [89]:
%%sql
select count(*) AS total_rows from athletes

   total_rows
0      269731

# 2. Age moyen, min, max

In [90]:
%%sql
SELECT MIN(Age) AS min_age,
       AVG(Age) AS avg_age,
       MAX(Age) AS max_age
FROM athletes;

   min_age    avg_age  max_age
0     10.0  25.454776     97.0

# 3. Taille moyenne des athletes

In [91]:
%%sql
SELECT AVG(Height) AS avg_height
FROM athletes;

   avg_height
0  175.338953

# 4. Poids moyen

In [92]:
%%sql
SELECT AVG(Weight) AS avg_weight
FROM athletes;

   avg_weight
0   70.701778

# 5. Nombre de l'ensemble de sports

In [93]:
%%sql
SELECT COUNT(DISTINCT Sport) AS total_sports
FROM athletes;

   total_sports
0            66

# 6. (KPI) Nombre de pays répresenter

In [94]:
%%sql
SELECT COUNT(DISTINCT NOC) AS total_countries
FROM athletes;

   total_countries
0              230

# 7. Nombre d'ediitions des jeux

In [95]:
%%sql
SELECT COUNT(DISTINCT Games) AS total_editions
FROM athletes;

   total_editions
0              51

# 8. Nombre total des médailles attribuées

In [96]:
%%sql
SELECT COUNT(*) AS total_medals
FROM athletes
WHERE Medal IS NOT NULL;

   total_medals
0         39772

# 9. Top 5 Sports les plus pratiquer

In [97]:
%%sql
SELECT Sport, COUNT(*) AS total
FROM athletes
GROUP BY Sport
ORDER BY total DESC
LIMIT 5;

        Sport  total
0   Athletics  38624
1  Gymnastics  26707
2    Swimming  23195
3    Shooting  11448
4     Cycling  10827

# 10. Repartitions hommes & femmes

In [98]:
%%sql
SELECT Sex, COUNT(*) AS total
FROM athletes
GROUP BY Sex;

  Sex   total
0   F   74378
1   M  195353

# B) Bivariate

# 1. Age moyen par sex

In [99]:
%%sql
SELECT sex, avg(age) from athletes
GROUP BY sex

  Sex   avg(age)
0   M  26.120139
1   F  23.707209

# 2. taille moyenne par sexe

In [100]:
%%sql
SELECT Sex, avg(HEIGHT)
from athletes
group by Sex ;

  Sex  avg(HEIGHT)
0   F   168.545520
1   M   177.925461

# 3. poids moyen par sports

In [101]:
%%sql
SELECT Sport, AVG(Weight) AS poids_moy
FROM athletes
GROUP BY Sport
ORDER BY poids_moy DESC
LIMIT 5;

        Sport  poids_moy
0    Baseball  84.918885
1   Bobsleigh  84.119099
2  Basketball  82.925513
3    Handball  80.525126
4  Water Polo  80.521684

# 4. Age moyen par sports

In [102]:
%%sql
SELECT Sport, AVG(age) AS age_moy
from athletes
group by Sport
ORDER BY age_moy DESC
limit 5;

              Sport    age_moy
0             Roque  46.363694
1  Art Competitions  41.484673
2              Polo  34.813409
3     Equestrianism  34.120340
4          Alpinism  34.003719

# 5. Nombre d'athletes par pays TOP (5)

In [103]:
%%sql
SELECT NOC, count(*) AS Top_5
from athletes
group by NOC
ORDER BY Top_5 DESC
limit 5;

   NOC  Top_5
0  USA  18604
1  FRA  12551
2  GBR  12115
3  ITA  10668
4  GER   9734

# 6. Nombre de médailles par sex

In [104]:
%%sql
SELECT Sex, COUNT(*) AS total
from athletes
WHERE Medal is not null
group by Sex ;

  Sex  total
0   M  28519
1   F  11253

# 7. Nombre de médailles par sport TOP (5)

In [105]:
%%sql
SELECT Sport, COUNT(*)  AS Top_5
from athletes
WHERE Medal is not null
group by Sport
order by Top_5 DESC
limit 5;

        Sport  Top_5
0   Athletics   3969
1    Swimming   3048
2      Rowing   2945
3  Gymnastics   2256
4     Fencing   1743

# 8.  Nombre d'athletes par saision

In [106]:
%%sql
SELECT Season, COUNT(*) total
from athletes
GROUP BY Season
order by total DESC;

   Season   total
0  Summer  221167
1  Winter   48564

# C) Multivariate

# 1. Age moyen par sport et sex

In [107]:
%%sql
SELECT Sport, Sex, AVG(Age) AS avg_age
FROM athletes
GROUP BY Sport, Sex
ORDER BY Sport, Sex
limit 5;

           Sport Sex    avg_age
0    Aeronautics   M  26.000000
1  Alpine Skiing   F  22.334609
2  Alpine Skiing   M  23.782632
3       Alpinism   F  43.000000
4       Alpinism   M  33.628874

# 2. Médailles par pays et par sexe

In [108]:
%%sql
SELECT NOC, Sex, COUNT(*) AS total_medals
FROM athletes
WHERE Medal IS NOT NULL
GROUP BY NOC, Sex
ORDER BY total_medals DESC
limit 5;

   NOC Sex  total_medals
0  USA   M          3832
1  URS   M          1816
2  USA   F          1805
3  GBR   M          1672
4  FRA   M          1539

# 3. age moyen des médailler par sport

In [109]:
%%sql
SELECT Sport, AVG(Age) AS avg_age_medalists
FROM athletes
WHERE Medal IS NOT NULL
GROUP BY Sport
ORDER BY avg_age_medalists DESC
limit 5;

              Sport  avg_age_medalists
0             Roque          53.333333
1  Art Competitions          41.896276
2     Equestrianism          35.268961
3              Polo          34.312083
4          Alpinism          34.003719

# 4.  Taille et poids moyens par sport

In [110]:
%%sql
SELECT Sport,
       AVG(Height) AS avg_height,
       AVG(Weight) AS avg_weight
FROM athletes
GROUP BY Sport
ORDER BY Sport
limit 5;

              Sport  avg_height  avg_weight
0       Aeronautics  175.338953   70.701778
1     Alpine Skiing  173.999247   71.684473
2          Alpinism  175.338953   70.701778
3           Archery  173.559063   70.143700
4  Art Competitions  175.324881   70.762170

# 5.  Participation par année ET par saison

In [1]:
%%sql
SELECT Year, Season, COUNT(*) AS total_athletes
FROM athletes
GROUP BY Year, Season
ORDER BY Year, Season
limit 15;

CatalogException: Catalog Error: Table with name athletes does not exist!
Did you mean "pg_tables"?

LINE 2: FROM athletes
             ^

# D) Views

In [112]:
# 1. Age moyen par sport

In [115]:
%%sql
CREATE VIEW agemoy_sport AS
SELECT Sport, AVG(Age) AS age_moy
FROM athletes
GROUP BY Sport;

CatalogException: Catalog Error: View with name "agemoy_sport" already exists!

# 2. Médailles par pays

In [116]:
%%sql
CREATE VIEW medailles_par_pays AS
SELECT NOC, COUNT(*) AS total_medals
FROM athletes
WHERE Medal IS NOT NULL
GROUP BY NOC
ORDER BY total_medals DESC
LIMIT 5;

CatalogException: Catalog Error: View with name "medailles_par_pays" already exists!

# 3. Répartions hommm\femmes

In [117]:
%%sql
CREATE VIEW repartition_sport AS
SELECT Sport, Sex, COUNT(*) AS total
FROM athletes
GROUP BY Sport, Sex;

CatalogException: Catalog Error: View with name "repartition_sport" already exists!

# 4.  Taille et poids moyens par sports

In [118]:
%%sql
CREATE VIEW physiqye_sport AS
SELECT Sport,
       AVG(Height) AS avg_height,
       AVG(Weight) AS avg_weight
FROM athletes
GROUP BY Sport;

CatalogException: Catalog Error: View with name "physiqye_sport" already exists!

# 5.  Participations par année et saision

In [119]:
%%sql
CREATE VIEW participations_année AS
SELECT Year, Season, COUNT(*) AS total_athletes
FROM athletes
GROUP BY Year, Season;

CatalogException: Catalog Error: View with name "participations_année" already exists!

In [ ]:
%%sql